app/controllers/dashboard/addresses_controller.rb

SELECT  "products".* FROM "products" ORDER BY id desc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.page(params[:page] || 1).per_page(params[:per_page] || 10)
      .order("id desc")

INSERT INTO "products" ("category_id", "title", "status", "uuid", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 9], ["title", "书包"], ["status", "on"], ["uuid", "0106T0BMSE"], ["description", "教学楼"], ["created_at", 2018-01-06 12:08:33 UTC], ["updated_at", 2018-01-06 12:08:33 UTC]]
---
  def create
    @product = Product.new(params.require(:product).permit!)
    @root_categories = Category.roots

    if @product.save